blogs/tcp-state-machine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TCP 状态转换过程</title>
<!-- 2016-05-06 五 09:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">TCP 状态转换过程</h1>
<p>
TCP建立连接的三次握手相对简单，可是断开连接的状态转换总是记不住，这里备忘一下。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 建立连接三次握手</h2>
<div class="outline-text-2" id="text-1">
<p>
用C表示client，S表示server。
</p>
<ol class="org-ol">
<li>C &#x2013; SYN &#x2013;&gt; S
</li>
<li>S &#x2013; SYN ACK &#x2013;&gt; C
</li>
<li>C &#x2013; ACK &#x2013;&gt; S
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 断开连接</h2>
<div class="outline-text-2" id="text-2">
<p>
连接建立后，就无所谓client和server，双方是对等的，既可以是client主动断开连接，也可以是server主动断开连接。用S1和S2表示连接的两端，并假设S1主动断开连接。
</p>
<ol class="org-ol">
<li>S1 &#x2013; FIN &#x2013;&gt; S2   (S1: <code>FIN_WAIT_1</code> )
</li>
<li>S2 &#x2013; ACK &#x2013;&gt; S1   (S2: <code>CLOSE_WAIT</code> , S1: <code>FIN_WAIT_2</code> )
</li>
<li>S2 &#x2013; FIN &#x2013;&gt; S1   (S2: <code>LAST_ACK</code> )
</li>
<li>S1 &#x2013; ACK &#x2013;&gt; S2   (S1: <code>TIME_WAIT</code> , S2: <code>CLOSED</code> )
</li>
</ol>

<p>
<code>TIME_WAIT</code> 会持续2MSL（Maximum segment lifetime），然后自动消失，只有主动断开连接的一方才会出现 <code>TIME_WAIT</code> 。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-05-06 五 09:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
